# ماشین حساب ساده در پایتون
# نویسنده زهرا
# این برنامه عملیات های جمع، تفریق، ضرب و تقسیم را انجام می‌دهد

while True  # یک حلقه بی‌نهایت تا وقتی کاربر خروج نزند
    print(nانتخاب عملیات)
    print( + برای جمع)
    print( - برای تفریق)
    print(  برای ضرب)
    print(  برای تقسیم)
    print( exit برای خروج)

    choice = input(عملیات مورد نظر را وارد کنید )  # گرفتن انتخاب کاربر

    if choice == exit  # اگر کاربر خروج را انتخاب کرد
        print(برنامه تمام شد. خداحافظ!)
        break  # خروج از حلقه

    if choice in [+, -, , ]  # اگر انتخاب یکی از این عملگرها بود
        num1 = float(input(عدد اول را وارد کنید ))  # گرفتن عدد اول
        num2 = float(input(عدد دوم را وارد کنید ))  # گرفتن عدد دوم

        if choice == +  # اگر عملگر جمع بود
            print(نتیجه, num1 + num2)

        elif choice == -  # اگر عملگر تفریق بود
            print(نتیجه, num1 - num2)

        elif choice ==   # اگر عملگر ضرب بود
            print(نتیجه, num1  num2)

        elif choice ==   # اگر عملگر تقسیم بود
            if num2 != 0  # چک کنیم که مخرج صفر نباشد
                print(نتیجه, num1  num2)
            else
                print(خطا! تقسیم بر صفر امکان‌پذیر نیست.)
    else
        print(عملیات نامعتبر! دوباره تلاش کنید.)
        